==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
ShallowConvNet                           [1, 4]                    --
├─Sequential: 1-1                        [1, 13, 1, 54]            --
│    └─Conv2d: 2-1                       [1, 487, 17, 54]          --
│    │    └─Conv2d: 3-1                  [1, 54, 487, 17]          810
│    └─Conv2d: 2-2                       [1, 487, 1, 54]           --
│    │    └─Conv2d: 3-2                  [1, 54, 487, 1]           49,572
│    └─BatchNorm2d: 2-3                  [1, 487, 1, 54]           --
│    │    └─BatchNorm2d: 3-3             [1, 54, 1, 487]           108
│    └─Square: 2-4                       [1, 487, 1, 54]           --
│    └─Pooling2d: 2-5                    [1, 13, 1, 54]            --
│    │    └─AvgPool2d: 3-4               [1, 54, 13, 1]            --
│    └─Log: 2-6                          [1, 13, 1, 54]            --
│    └─Dropout: 2-7                      [1, 13, 1, 54]            --
├─Sequential: 1-2                        [1, 4]                    --
│    └─Flatten: 2-8                      [1, 702]                  --
│    └─Linear: 2-9                       [1, 4]                    --
│    │    └─Linear: 3-5                  [1, 4]                    2,812
│    └─LogSoftmax: 2-10                  [1, 4]                    --
==========================================================================================
Total params: 53,302
Trainable params: 53,302
Non-trainable params: 0
Total mult-adds (M): 30.85
==========================================================================================
Input size (MB): 0.03
Forward/backward pass size (MB): 4.00
Params size (MB): 0.21
Estimated Total Size (MB): 4.24
==========================================================================================