==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
Pattern_Expansion_DeepLearing            [1, 4]                    --
├─Sequential: 1-1                        [1, 21, 1, 347]           --
│    └─Conv2d: 2-1                       [1, 500, 17, 61]          --
│    │    └─Conv2d: 3-1                  [1, 61, 500, 17]          2,013
│    └─BatchNorm2d: 2-2                  [1, 500, 17, 61]          --
│    │    └─BatchNorm2d: 3-2             [1, 61, 17, 500]          122
│    └─Conv2d: 2-3                       [1, 125, 1, 110]          --
│    │    └─Conv2d: 3-3                  [1, 110, 125, 1]          114,070
│    └─BatchNorm2d: 2-4                  [1, 125, 1, 110]          --
│    │    └─BatchNorm2d: 3-4             [1, 110, 1, 125]          220
│    └─Conv2d: 2-5                       [1, 42, 1, 165]           --
│    │    └─Conv2d: 3-5                  [1, 165, 42, 1]           290,400
│    └─BatchNorm2d: 2-6                  [1, 42, 1, 165]           --
│    │    └─BatchNorm2d: 3-6             [1, 165, 1, 42]           330
│    └─ELU: 2-7                          [1, 42, 1, 165]           --
│    └─Conv2d: 2-8                       [1, 22, 1, 198]           --
│    │    └─Conv2d: 3-7                  [1, 198, 22, 1]           261,360
│    └─BatchNorm2d: 2-9                  [1, 22, 1, 198]           --
│    │    └─BatchNorm2d: 3-8             [1, 198, 1, 22]           396
│    └─ELU: 2-10                         [1, 22, 1, 198]           --
│    └─Conv2d: 2-11                      [1, 21, 1, 347]           --
│    │    └─Conv2d: 3-9                  [1, 347, 21, 1]           274,824
│    └─ELU: 2-12                         [1, 21, 1, 347]           --
├─Sequential: 1-2                        [1, 4]                    --
│    └─Flatten: 2-13                     [1, 7287]                 --
│    └─Linear: 2-14                      [1, 4]                    --
│    │    └─Linear: 3-10                 [1, 4]                    29,152
│    └─LogSoftmax: 2-15                  [1, 4]                    --
==========================================================================================
Total params: 972,887
Trainable params: 972,887
Non-trainable params: 0
Total mult-adds (M): 55.12
==========================================================================================
Input size (MB): 0.03
Forward/backward pass size (MB): 8.75
Params size (MB): 3.89
Estimated Total Size (MB): 12.68
==========================================================================================