==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
Condenced_EEG_Net                        [1, 4]                    --
├─Sequential: 1-1                        [1, 17, 1, 215]           --
│    └─Conv2d: 2-1                       [1, 500, 17, 61]          --
│    │    └─Conv2d: 3-1                  [1, 61, 500, 17]          3,111
│    └─BatchNorm2d: 2-2                  [1, 500, 17, 61]          --
│    │    └─BatchNorm2d: 3-2             [1, 61, 17, 500]          122
│    └─Conv2d: 2-3                       [1, 500, 1, 122]          --
│    │    └─Conv2d: 3-3                  [1, 122, 500, 1]          2,074
│    └─BatchNorm2d: 2-4                  [1, 500, 1, 122]          --
│    │    └─BatchNorm2d: 3-4             [1, 122, 1, 500]          244
│    └─ELU: 2-5                          [1, 500, 1, 122]          --
│    └─Pooling2d: 2-6                    [1, 125, 1, 122]          --
│    │    └─AvgPool2d: 3-5               [1, 122, 125, 1]          --
│    └─Dropout: 2-7                      [1, 125, 1, 122]          --
│    └─Conv2d: 2-8                       [1, 125, 1, 215]          --
│    │    └─Conv2d: 3-6                  [1, 215, 125, 1]          393,665
│    └─BatchNorm2d: 2-9                  [1, 125, 1, 215]          --
│    │    └─BatchNorm2d: 3-7             [1, 215, 1, 125]          430
│    └─Pooling2d: 2-10                   [1, 17, 1, 215]           --
│    │    └─AvgPool2d: 3-8               [1, 215, 17, 1]           --
├─Sequential: 1-2                        [1, 4]                    --
│    └─Flatten: 2-11                     [1, 3655]                 --
│    └─Linear: 2-12                      [1, 4]                    --
│    │    └─Linear: 3-9                  [1, 4]                    14,624
│    └─LogSoftmax: 2-13                  [1, 4]                    --
==========================================================================================
Total params: 414,270
Trainable params: 414,270
Non-trainable params: 0
Total mult-adds (M): 76.70
==========================================================================================
Input size (MB): 0.03
Forward/backward pass size (MB): 9.70
Params size (MB): 1.66
Estimated Total Size (MB): 11.39
==========================================================================================